# ApplicationGUID Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..ApplicationGUID Property
Schema Class See Also
---
The GUID of the application or add-in that may access entities of this Schema under the Application access level.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Guid ApplicationGUID { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplicationGUID As Guid
	Get
```

Visual C++
---
```text
public:
property Guid ApplicationGUID {
	Guid get ();
}
```

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace